## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 12 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                NAME                                                 |
|----------|-----------------------------------------------------------------------------------------------------|
| update   | `aws_cloudwatch_dashboard.errors[0]`                                                                |
|          | `aws_cloudwatch_dashboard.notify_system[0]`                                                         |
|          | `aws_cloudwatch_query_definition.callback-failures[0]`                                              |
|          | `aws_cloudwatch_query_definition.callback-max-retry-failures-by-service[0]`                         |
|          | `aws_cloudwatch_query_definition.celery-errors[0]`                                                  |
|          | `aws_iam_policy.parameters_csi`                                                                     |
|          | `aws_iam_policy.secrets_csi`                                                                        |
|          | `aws_kinesis_firehose_delivery_stream.firehose-waf-logs`                                            |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                  |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]` |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[2]` |
| recreate | `aws_secretsmanager_secret_version.pr_bot_app_id`                                                   |
|          | `aws_secretsmanager_secret_version.pr_bot_installation_id`                                          |
|          | `aws_secretsmanager_secret_version.pr_bot_private_key`                                              |
| add      | `aws_cloudwatch_metric_alarm.service-callback-too-many-failures-warning[0]`                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.errors[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "errors" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ dashboard_body = (sensitive value)
        id             = "Errors"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.notify_system[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "notify_system" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ dashboard_body = (sensitive value)
        id             = "Notify-System-Overview"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.service-callback-too-many-failures-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "service-callback-too-many-failures-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Service reached the max number of callback retries 25 times in 5 minutes"
      + alarm_name                            = "service-callback-too-many-failures-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "callback-max-retry-failures"
      + namespace                             = "LogMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 25
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.callback-failures[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "callback-failures" {
        id                  = "db0860c7-62aa-4c37-8214-bfb6b749905c"
        name                = "Callbacks / Callback errors by notification_id"
      ~ query_string        = <<-EOT
            fields @timestamp, @notification_id, @url, @error
            | filter kubernetes.container_name like /^celery/
            | filter @message like /send_delivery_status_to_service request failed for notification_id:/
          - | parse @message 'send_delivery_status_to_service request failed for notification_id: * and url: * exc: *' as @notification_id, @url, @error
          + | parse @message 'send_delivery_status_to_service request failed for notification_id: * and url: * service: * exc: *' as @notification_id, @url, @service_id, @error
            | limit 10000
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.callback-max-retry-failures-by-service[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "callback-max-retry-failures-by-service" {
        id                  = "4c82a6be-6862-447e-b369-3c2defb58d64"
        name                = "Callbacks / Callbacks that exceeded MaxRetries by service"
      ~ query_string        = <<-EOT
            fields @timestamp, @service_id, @callback_url, @notification_id
            | filter kubernetes.container_name like /^celery/
            | filter @message like /send_delivery_status_to_service has retried the max num of times for callback url/
          - | parse @message 'Retry: send_delivery_status_to_service has retried the max num of times for callback url * and notification_id: * for service: *' as @callback_url, @notification_id, @service_id
          + | parse @message 'Retry: send_delivery_status_to_service has retried the max num of times for callback url * and notification_id: * service: *' as @callback_url, @notification_id, @service_id
            | sort @timestamp desc
            | stats count(@service_id) by @service_id, bin(30m)
            | limit 10000
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.celery-errors[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "celery-errors" {
        id                  = "6e83dbc1-06ae-4b00-8414-75835131cbc2"
        name                = "Celery / Errors"
      ~ query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^celery/
          - | filter @message like /ERROR\/.*Worker/ or @message like /ERROR\/MainProcess/ 
          + | filter @message like /ERROR\/.*Worker/ or @message like /ERROR\/MainProcess/
            | sort @timestamp desc
            | limit 20
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.parameters_csi will be updated in-place
  ~ resource "aws_iam_policy" "parameters_csi" {
        id               = "arn:aws:iam::296255494825:policy/parameters-csi-policy"
        name             = "parameters-csi-policy"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy           = (sensitive value)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.secrets_csi will be updated in-place
  ~ resource "aws_iam_policy" "secrets_csi" {
        id               = "arn:aws:iam::296255494825:policy/secrets-csi-policy"
        name             = "secrets-csi-policy"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy           = (sensitive value)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-waf-logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose-waf-logs" {
        id             = "arn:aws:firehose:ca-central-1:296255494825:deliverystream/aws-waf-logs-notification-canada-ca-waf"
        name           = "aws-waf-logs-notification-canada-ca-waf"
        tags           = {
            "CostCenter" = "notification-canada-ca-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ prefix              = (sensitive value)
            # (10 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_secretsmanager_secret_version.pr_bot_app_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "pr_bot_app_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:PR_BOT_APP_ID-EHn56m" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:PR_BOT_APP_ID-EHn56m|terraform-20240321141403102100000007" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240321141403102100000007" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.pr_bot_installation_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "pr_bot_installation_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:PR_BOT_INSTALLATION_ID-lLMugo" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:PR_BOT_INSTALLATION_ID-lLMugo|terraform-20240321141403102100000006" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240321141403102100000006" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.pr_bot_private_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "pr_bot_private_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:PR_BOT_PRIVATE_KEY-IJGWmo" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:PR_BOT_PRIVATE_KEY-IJGWmo|terraform-20240321141403094600000005" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240321141403094600000005" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-cloud-watch-forwarder"
      ~ layers                         = [
          ~ "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:153" -> "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:163",
        ]
        tags                           = {
            "CostCentre" = "notification-canada-ca-production"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be updated in-place
  ~ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
        id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ source_arn          = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] will be updated in-place
  ~ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
        id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ source_arn          = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[2] will be updated in-place
  ~ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
        id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-2"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ source_arn          = (sensitive value)
        # (6 unchanged attributes hidden)
    }

Plan: 4 to add, 12 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acmpca_certificate_authority.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
